<a href="https://colab.research.google.com/github/lavanyapunnapuneeru/6_student-management-system/blob/master/UNIT_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# UNIT-II

### Data wrangling

### Data Transformation

#### Data wrangling is the process of cleaning and unifying messy and complex data sets for easy access and analysis.

Reading and Writing Text Files

-> pandas features a number of functions for reading tabular data as a DataFrame object.
-> read_csv and read_table

Parsing functions in pandas

Function             Description

read_csv          Load delimited data from a file, URL, or file-like object. Use comma as default delimiter
read_table        Load delimited data from a file, URL, or file-like object. Use tab ('\t') as default delimiter
read_fwf          Read data in fixed-width column format (that is, no delimiters)
read_clipboard    Version of read_table that reads data from the clipboard. Useful for converting tables from web pages

In [ ]:
pwd

'C:\\Users\\mohan'

In [ ]:
!type ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [ ]:
import pandas as pd
df=pd.read_table('ex1.csv'), sep=','

In [ ]:
df

  a,b,c,d,message
0   1,2,3,4,hello
1   5,6,7,8,world
2  9,10,11,12,foo

In [ ]:
df=pd.read_table('ex1.csv', sep=',')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

##### Files with No Header

Assign default column names

In [ ]:
!type ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [ ]:
df=pd.read_csv("ex2.csv", header=None)
df

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

 you can specify names yourself

In [ ]:
df=pd.read_csv("ex2.csv",  names=['a', 'b', 'c', 'd', 'message'])
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
df=pd.read_csv("ex2.csv",  names=['a', 'b', 'c', 'd', 'message'], index_col='message')
df

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [ ]:
!type mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [ ]:
parsed = pd.read_csv('mindex.csv', index_col=['key1', 'key2'])

In [ ]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

##### read_csv /read_table function arguments

   Argument                              Description
   
path                   String indicating filesystem location, URL, or file-like object
sep or delimiter       Character sequence or regular expression to use to split fields in each row
header                 Row number to use as column names. Defaults to 0 (first row), but should be None if there is no    
                       header row
index_col              Column numbers or names to use as the row index in the result. Can be a single name/number or a list
                       of them for a hierarchical index
names                  List of column names for result, combine with header=None
skiprows               Number of rows at beginning of file to ignore or list of row numbers (starting from 0) to skip
na_values              Sequence of values to replace with NA

### Reading Text Files in Pieces

Read in a small piece of a file or iterate through  smaller chunks of the file When processing very large files.

In [ ]:
!type ex6.csv

In [ ]:
import pandas as pd
result = pd.read_csv('ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [ ]:
 pd.read_csv('ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

##### To read out a file in pieces, specify a chunksize as a number of rows:

In [ ]:
chunker = pd.read_csv('ex6.csv', chunksize=1000)

In [ ]:
chunker

The TextParser object returned by read_csv allows user to iterate over the parts of the file according to the chunksize.

In [ ]:
chunker = pd.read_csv('ex6.csv', chunksize=1000)
tot = pd.Series([])
for piece in chunker:
 tot = tot.add(piece['key'].value_counts(), fill_value=0)
tot = tot.sort_values(ascending=False)

<ipython-input-8-3e03d381d1b6>:2: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  tot = pd.Series([])

In [ ]:
tot

we can iterate over ex6.csv, aggregating the value counts in the 'key' column like so:

### Writing Data Out to Text Format

In [ ]:
data = pd.read_csv('ex5.csv')

data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [ ]:
!type ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [ ]:
data.to_csv('out.csv')

In [ ]:
!type out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [ ]:
import sys 
data.to_csv(sys.stdout, sep=':')

:something:a:b:c:d:message
0:one:1:2:3.0:4:
1:two:5:6::8:world
2:three:9:10:11.0:12:foo

In [ ]:
!type out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [ ]:
data.to_csv(sys.stdout, index=False, header=False)AS

### Reading JSON

### Reading HTML

#### Using lxml

In [ ]:
from lxml.html import parse

In [ ]:
from urllib2 import urlopen

ModuleNotFoundError: No module named 'urllib2'

In [ ]:
from urllib.request import urlopen
html = urlopen("http://www.google.com/").read()
print(html)

b'<!doctype html><html itemscope="" itemtype="http://schema.org/WebPage" lang="en-IN"><head><meta content="text/html; charset=UTF-8" http-equiv="Content-Type"><meta content="/images/branding/googleg/1x/googleg_standard_color_128dp.png" itemprop="image"><title>Google</title><script nonce="PAEdLby0HsRNQ6TqmOCWug==">(function(){window.google={kEI:\'ouSIYOanNLH1juMPwoSqmAQ\',kEXPI:\'0,1302536,56873,954,5104,207,4804,2316,383,246,5,1354,5251,16230,10,1106275,1233,1196518,501,30,28,328957,51224,16114,19397,9287,9188,8384,4858,1362,9291,3021,2823,1073,850,12841,4020,978,13228,2054,1793,3600,592,6430,1141,6291,1221,5875,4516,2780,917,2277,8,570,2226,1593,1279,2212,530,149,1103,840,517,1522,4258,108,4012,2023,1777,520,4269,328,1284,8789,3227,2845,7,5599,6755,5096,7877,4928,108,3407,908,2,941,2614,2397,1386,9359,3,576,1014,1,820,7,4618,148,5990,5333,2652,4,1528,2304,1236,5803,74,1717,266,2627,459,1555,4,11497,3824,1299,1751,2658,4243,518,912,564,1120,30,8129,1656,1630,2213,1592,713,638,7080,10535,665,2145,3661,2551,2047,907,1140,17,3121,6,908,3,1902,1639,1,6556,3388,4318,448,1814,38,245,38,874,60,5938,1254,1194,2,2401,1897,402,30,2859,876,1605,2,1394,1533,6,1267,1553,5,157,2,488,1916,22,631,483,240,2,1822,2698,308,15,402,362,450,3,33,3,63,471,142,4086,1250,2,61,174,444,166,88,167,493,354,2,593,1427,3,80,11,2044,287,1274,1331,129,940,625,1147,406,2347,285,37,825,33,5,17,148,788,2,2,2,657,54,827,577,4,800,46,235,16,36,644,18,334,150,79,298,54,307,1305,528,163,755,1,551,1296,274,2,184,238,891,1,704,95,1004,368,5655134,3905,226,63,30,8797692,882,444,1,2,80,1,1796,1,9,2,2551,1,748,141,795,563,1,4265,1,1,2,1331,3299,843,1,2608,155,17,13,72,139,4,2,20,2,169,13,19,46,5,39,96,62,11,4,207,4,4,4,4,4,4,8,4,4,4,24,68,128,29,2,2,1,2,1,2,2,7,4,1,2,4,2,59,2,29,2,6,51,1,24,13,9,27,16,26,21,5,7,17,23955918,148,4010125,268,27379,2,833,954,1106,258\',kBL:\'tbUn\'};google.sn=\'webhp\';google.kHL=\'en-IN\';})();(function(){\nvar f,h=[];function k(a){for(var b;a&&(!a.getAttribute||!(b=a.getAttribute("eid")));)a=a.parentNode;return b||f}function l(a){for(var b=null;a&&(!a.getAttribute||!(b=a.getAttribute("leid")));)a=a.parentNode;return b}\nfunction m(a,b,c,d,g){var e="";c||-1!=b.search("&ei=")||(e="&ei="+k(d),-1==b.search("&lei=")&&(d=l(d))&&(e+="&lei="+d));d="";!c&&window._cshid&&-1==b.search("&cshid=")&&"slh"!=a&&(d="&cshid="+window._cshid);c=c||"/"+(g||"gen_204")+"?atyp=i&ct="+a+"&cad="+b+e+"&zx="+Date.now()+d;/^http:/i.test(c)&&"https:"==window.location.protocol&&(google.ml&&google.ml(Error("a"),!1,{src:c,glmm:1}),c="");return c};f=google.kEI;google.getEI=k;google.getLEI=l;google.ml=function(){return null};google.log=function(a,b,c,d,g){if(c=m(a,b,c,d,g)){a=new Image;var e=h.length;h[e]=a;a.onerror=a.onload=a.onabort=function(){delete h[e]};a.src=c}};google.logUrl=m;}).call(this);(function(){\ngoogle.y={};google.sy=[];google.x=function(a,b){if(a)var c=a.id;else{do c=Math.random();while(google.y[c])}google.y[c]=[a,b];return!1};google.sx=function(a){google.sy.push(a)};google.lm=[];google.plm=function(a){google.lm.push.apply(google.lm,a)};google.lq=[];google.load=function(a,b,c){google.lq.push([[a],b,c])};google.loadAll=function(a,b){google.lq.push([a,b])};google.bx=!1;google.lx=function(){};}).call(this);google.f={};(function(){\ndocument.documentElement.addEventListener("submit",function(b){var a;if(a=b.target){var c=a.getAttribute("data-submitfalse");a="1"==c||"q"==c&&!a.elements.q.value?!0:!1}else a=!1;a&&(b.preventDefault(),b.stopPropagation())},!0);document.documentElement.addEventListener("click",function(b){var a;a:{for(a=b.target;a&&a!=document.documentElement;a=a.parentElement)if("A"==a.tagName){a="1"==a.getAttribute("data-nohref");break a}a=!1}a&&b.preventDefault()},!0);}).call(this);</script><style>#gbar,#guser{font-size:13px;padding-top:1px !important;}#gbar{height:22px}#guser{padding-bottom:7px !important;text-align:right}.gbh,.gbd{border-top:1px solid #c9d7f1;font-size:1px}.gbh{height:0;position:absolute;top:24px;width:100%}@media all{.gb1{height:22px;margin-right:.5em;vertical-align:top}#gbar{float:left}}a.gb1,a.gb4{text-decoration:underline !important}a.gb1,a.gb4{color:#00c !important}.gbi .gb4{color:#dd8e27 !important}.gbf .gb4{color:#900 !important}\n</style><style>body,td,a,p,.h{font-family:arial,sans-serif}body{margin:0;overflow-y:scroll}#gog{padding:3px 8px 0}td{line-height:.8em}.gac_m td{line-height:17px}form{margin-bottom:20px}.h{color:#1558d6}em{font-weight:bold;font-style:normal}.lst{height:25px;width:496px}.gsfi,.lst{font:18px arial,sans-serif}.gsfs{font:17px arial,sans-serif}.ds{display:inline-box;display:inline-block;margin:3px 0 4px;margin-left:4px}input{font-family:inherit}body{background:#fff;color:#000}a{color:#4b11a8;text-decoration:none}a:hover,a:active{text-decoration:underline}.fl a{color:#1558d6}a:visited{color:#4b11a8}.sblc{padding-top:5px}.sblc a{display:block;margin:2px 0;margin-left:13px;font-size:11px}.lsbb{background:#f8f9fa;border:solid 1px;border-color:#dadce0 #70757a #70757a #dadce0;height:30px}.lsbb{display:block}#WqQANb a{display:inline-block;margin:0 12px}.lsb{background:url(/images/nav_logo229.png) 0 -261px repeat-x;border:none;color:#000;cursor:pointer;height:30px;margin:0;outline:0;font:15px arial,sans-serif;vertical-align:top}.lsb:active{background:#dadce0}.lst:focus{outline:none}</style><script nonce="PAEdLby0HsRNQ6TqmOCWug=="></script></head><body bgcolor="#fff"><script nonce="PAEdLby0HsRNQ6TqmOCWug==">(function(){var src=\'/images/nav_logo229.png\';var iesg=false;document.body.onload = function(){window.n && window.n();if (document.images){new Image().src=src;}\nif (!iesg){document.f&&document.f.q.focus();document.gbqf&&document.gbqf.q.focus();}\n}\n})();</script><div id="mngb"><div id=gbar><nobr><b class=gb1>Search</b> <a class=gb1 href="http://www.google.co.in/imghp?hl=en&tab=wi">Images</a> <a class=gb1 href="http://maps.google.co.in/maps?hl=en&tab=wl">Maps</a> <a class=gb1 href="https://play.google.com/?hl=en&tab=w8">Play</a> <a class=gb1 href="http://www.youtube.com/?gl=IN&tab=w1">YouTube</a> <a class=gb1 href="https://news.google.com/?tab=wn">News</a> <a class=gb1 href="https://mail.google.com/mail/?tab=wm">Gmail</a> <a class=gb1 href="https://drive.google.com/?tab=wo">Drive</a> <a class=gb1 style="text-decoration:none" href="https://www.google.co.in/intl/en/about/products?tab=wh"><u>More</u> &raquo;</a></nobr></div><div id=guser width=100%><nobr><span id=gbn class=gbi></span><span id=gbf class=gbf></span><span id=gbe></span><a href="http://www.google.co.in/history/optout?hl=en" class=gb4>Web History</a> | <a  href="/preferences?hl=en" class=gb4>Settings</a> | <a target=_top id=gb_70 href="https://accounts.google.com/ServiceLogin?hl=en&passive=true&continue=http://www.google.com/&ec=GAZAAQ" class=gb4>Sign in</a></nobr></div><div class=gbh style=left:0></div><div class=gbh style=right:0></div></div><center><br clear="all" id="lgpd"><div id="lga"><img alt="Google" height="92" src="/images/branding/googlelogo/1x/googlelogo_white_background_color_272x92dp.png" style="padding:28px 0 14px" width="272" id="hplogo"><br><br></div><form action="/search" name="f"><table cellpadding="0" cellspacing="0"><tr valign="top"><td width="25%">&nbsp;</td><td align="center" nowrap=""><input name="ie" value="ISO-8859-1" type="hidden"><input value="en-IN" name="hl" type="hidden"><input name="source" type="hidden" value="hp"><input name="biw" type="hidden"><input name="bih" type="hidden"><div class="ds" style="height:32px;margin:4px 0"><input class="lst" style="margin:0;padding:5px 8px 0 6px;vertical-align:top;color:#000" autocomplete="off" value="" title="Google Search" maxlength="2048" name="q" size="57"></div><br style="line-height:0"><span class="ds"><span class="lsbb"><input class="lsb" value="Google Search" name="btnG" type="submit"></span></span><span class="ds"><span class="lsbb"><input class="lsb" id="tsuid1" value="I\'m Feeling Lucky" name="btnI" type="submit"><script nonce="PAEdLby0HsRNQ6TqmOCWug==">(function(){var id=\'tsuid1\';document.getElementById(id).onclick = function(){if (this.form.q.value){this.checked = 1;if (this.form.iflsig)this.form.iflsig.disabled = false;}\nelse top.location=\'/doodles/\';};})();</script><input value="AINFCbYAAAAAYIjyspSUBuHq8AcSQwYdq6QyeRSuIwxf" name="iflsig" type="hidden"></span></span></td><td class="fl sblc" align="left" nowrap="" width="25%"><a href="/advanced_search?hl=en-IN&amp;authuser=0">Advanced search</a></td></tr></table><input id="gbv" name="gbv" type="hidden" value="1"><script nonce="PAEdLby0HsRNQ6TqmOCWug==">(function(){\nvar a,b="1";if(document&&document.getElementById)if("undefined"!=typeof XMLHttpRequest)b="2";else if("undefined"!=typeof ActiveXObject){var c,d,e=["MSXML2.XMLHTTP.6.0","MSXML2.XMLHTTP.3.0","MSXML2.XMLHTTP","Microsoft.XMLHTTP"];for(c=0;d=e[c++];)try{new ActiveXObject(d),b="2"}catch(h){}}a=b;if("2"==a&&-1==location.search.indexOf("&gbv=2")){var f=google.gbvu,g=document.getElementById("gbv");g&&(g.value=a);f&&window.setTimeout(function(){location.href=f},0)};}).call(this);</script></form><div id="gac_scont"></div><div style="font-size:83%;min-height:3.5em"><br><div id="prm"><style>.szppmdbYutt__middle-slot-promo{font-size:small;margin-bottom:32px}.szppmdbYutt__middle-slot-promo a.ZIeIlb{display:inline-block;text-decoration:none}.szppmdbYutt__middle-slot-promo img{border:none;margin-right:5px;vertical-align:middle}</style><div class="szppmdbYutt__middle-slot-promo" data-ved="0ahUKEwjmgNiVjaDwAhWxumMGHUKCCkMQnIcBCAQ"><a class="NKcBbd" href="https://www.google.com/url?q=https://www.google.com/search%3Fq%3Dcoronavirus%2Btesting%26utm_source%3DHPPTC0&amp;source=hpp&amp;id=19024086&amp;ct=3&amp;usg=AFQjCNGE3Gk9QZBNqoaeXzWK40fGSnSPBQ&amp;sa=X&amp;ved=0ahUKEwjmgNiVjaDwAhWxumMGHUKCCkMQ8IcBCAU" rel="nofollow">Find ICMR authorized COVID-19 testing centers near you</a></div></div><div id="gws-output-pages-elements-homepage_additional_languages__als"><style>#gws-output-pages-elements-homepage_additional_languages__als{font-size:small;margin-bottom:24px}#SIvCob{display:inline-block;line-height:28px;}#SIvCob a{padding:0 3px;}.H6sW5{display:inline-block;margin:0 2px;white-space:nowrap}.z4hgWe{display:inline-block;margin:0 2px}</style><div id="SIvCob">Google offered in:  <a href="http://www.google.com/setprefs?sig=0_8eZ01I_qzvigT8Ufe2ka6J17k_U%3D&amp;hl=hi&amp;source=homepage&amp;sa=X&amp;ved=0ahUKEwjmgNiVjaDwAhWxumMGHUKCCkMQ2ZgBCAc">&#2361;&#2367;&#2344;&#2381;&#2342;&#2368;</a>    <a href="http://www.google.com/setprefs?sig=0_8eZ01I_qzvigT8Ufe2ka6J17k_U%3D&amp;hl=bn&amp;source=homepage&amp;sa=X&amp;ved=0ahUKEwjmgNiVjaDwAhWxumMGHUKCCkMQ2ZgBCAg">&#2476;&#2494;&#2434;&#2482;&#2494;</a>    <a href="http://www.google.com/setprefs?sig=0_8eZ01I_qzvigT8Ufe2ka6J17k_U%3D&amp;hl=te&amp;source=homepage&amp;sa=X&amp;ved=0ahUKEwjmgNiVjaDwAhWxumMGHUKCCkMQ2ZgBCAk">&#3108;&#3142;&#3122;&#3137;&#3095;&#3137;</a>    <a href="http://www.google.com/setprefs?sig=0_8eZ01I_qzvigT8Ufe2ka6J17k_U%3D&amp;hl=mr&amp;source=homepage&amp;sa=X&amp;ved=0ahUKEwjmgNiVjaDwAhWxumMGHUKCCkMQ2ZgBCAo">&#2350;&#2352;&#2366;&#2336;&#2368;</a>    <a href="http://www.google.com/setprefs?sig=0_8eZ01I_qzvigT8Ufe2ka6J17k_U%3D&amp;hl=ta&amp;source=homepage&amp;sa=X&amp;ved=0ahUKEwjmgNiVjaDwAhWxumMGHUKCCkMQ2ZgBCAs">&#2980;&#2990;&#3007;&#2996;&#3021;</a>    <a href="http://www.google.com/setprefs?sig=0_8eZ01I_qzvigT8Ufe2ka6J17k_U%3D&amp;hl=gu&amp;source=homepage&amp;sa=X&amp;ved=0ahUKEwjmgNiVjaDwAhWxumMGHUKCCkMQ2ZgBCAw">&#2711;&#2753;&#2716;&#2736;&#2750;&#2724;&#2752;</a>    <a href="http://www.google.com/setprefs?sig=0_8eZ01I_qzvigT8Ufe2ka6J17k_U%3D&amp;hl=kn&amp;source=homepage&amp;sa=X&amp;ved=0ahUKEwjmgNiVjaDwAhWxumMGHUKCCkMQ2ZgBCA0">&#3221;&#3240;&#3277;&#3240;&#3233;</a>    <a href="http://www.google.com/setprefs?sig=0_8eZ01I_qzvigT8Ufe2ka6J17k_U%3D&amp;hl=ml&amp;source=homepage&amp;sa=X&amp;ved=0ahUKEwjmgNiVjaDwAhWxumMGHUKCCkMQ2ZgBCA4">&#3374;&#3378;&#3375;&#3390;&#3379;&#3330;</a>    <a href="http://www.google.com/setprefs?sig=0_8eZ01I_qzvigT8Ufe2ka6J17k_U%3D&amp;hl=pa&amp;source=homepage&amp;sa=X&amp;ved=0ahUKEwjmgNiVjaDwAhWxumMGHUKCCkMQ2ZgBCA8">&#2602;&#2672;&#2588;&#2622;&#2604;&#2624;</a>  </div></div></div><span id="footer"><div style="font-size:10pt"><div style="margin:19px auto;text-align:center" id="WqQANb"><a href="/intl/en/ads/">Advertising\xa0Programs</a><a href="http://www.google.co.in/services/">Business Solutions</a><a href="/intl/en/about.html">About Google</a><a href="http://www.google.com/setprefdomain?prefdom=IN&amp;prev=http://www.google.co.in/&amp;sig=K_Z2ByFG7ea1zx-PngPJuu90cijfw%3D">Google.co.in</a></div></div><p style="font-size:8pt;color:#70757a">&copy; 2021 - <a href="/intl/en/policies/privacy/">Privacy</a> - <a href="/intl/en/policies/terms/">Terms</a></p></span></center><script nonce="PAEdLby0HsRNQ6TqmOCWug==">(function(){window.google.cdo={height:0,width:0};(function(){\nvar a=window.innerWidth,b=window.innerHeight;if(!a||!b){var c=window.document,d="CSS1Compat"==c.compatMode?c.documentElement:c.body;a=d.clientWidth;b=d.clientHeight}a&&b&&(a!=google.cdo.width||b!=google.cdo.height)&&google.log("","","/client_204?&atyp=i&biw="+a+"&bih="+b+"&ei="+google.kEI);}).call(this);})();</script> <script nonce="PAEdLby0HsRNQ6TqmOCWug==">(function(){google.xjs={ck:\'xjs.hp.v1cE8KxQzDU.L.X.O\',cs:\'ACT90oGIO2mzsMNn8ZjOEWiqPA8P8Krw3g\',excm:[]};})();</script>  <script nonce="PAEdLby0HsRNQ6TqmOCWug==">(function(){var u=\'/xjs/_/js/k\\x3dxjs.hp.en.vVnPB8ZeXPI.O/m\\x3dsb_he,d/am\\x3dAHgCHA/d\\x3d1/ed\\x3d1/rs\\x3dACT90oGlokelthfecWwcb7AzPN3TRYtPPw\';\nvar d=this||self,e=function(a){return a};var f;var h=function(a,b){this.g=b===g?a:""};h.prototype.toString=function(){return this.g+""};var g={};var l=null,m=/^[\\w+/_-]+[=]{0,2}$/,n=function(a){return a.querySelector?(a=a.querySelector("script[nonce]"))&&(a=a.nonce||a.getAttribute("nonce"))&&m.test(a)?a:"":""};function p(){var a=u;google.lx=function(){q(a);google.lx=function(){}};google.bx||google.lx()}\nfunction q(a){var b=document;var c="SCRIPT";"application/xhtml+xml"===b.contentType&&(c=c.toLowerCase());c=b.createElement(c);if(void 0===f){b=null;var k=d.trustedTypes;if(k&&k.createPolicy){try{b=k.createPolicy("goog#html",{createHTML:e,createScript:e,createScriptURL:e})}catch(r){d.console&&d.console.error(r.message)}f=b}else f=b}a=(b=f)?b.createScriptURL(a):a;a=new h(a,g);c.src=a instanceof h&&a.constructor===h?a.g:"type_error:TrustedResourceUrl";(a=c.ownerDocument&&c.ownerDocument.defaultView)&&\na!=d?a=n(a.document):(null===l&&(l=n(d.document)),a=l);a&&c.setAttribute("nonce",a);google.timers&&google.timers.load&&google.tick&&google.tick("load","xjsls");document.body.appendChild(c);google.psa=!0};setTimeout(function(){p()},0);})();(function(){window.google.xjsu=\'/xjs/_/js/k\\x3dxjs.hp.en.vVnPB8ZeXPI.O/m\\x3dsb_he,d/am\\x3dAHgCHA/d\\x3d1/ed\\x3d1/rs\\x3dACT90oGlokelthfecWwcb7AzPN3TRYtPPw\';})();function _DumpException(e){throw e;}\nfunction _F_installCss(c){}\n(function(){google.jl={blt:\'none\',dw:false,emtn:0,ine:false,lls:\'default\',pdt:0,snet:true,uwp:true};})();(function(){var pmc=\'{\\x22d\\x22:{},\\x22sb_he\\x22:{\\x22agen\\x22:true,\\x22cgen\\x22:true,\\x22client\\x22:\\x22heirloom-hp\\x22,\\x22dh\\x22:true,\\x22dhqt\\x22:true,\\x22ds\\x22:\\x22\\x22,\\x22ffql\\x22:\\x22en\\x22,\\x22fl\\x22:true,\\x22host\\x22:\\x22google.com\\x22,\\x22isbh\\x22:28,\\x22jsonp\\x22:true,\\x22msgs\\x22:{\\x22cibl\\x22:\\x22Clear Search\\x22,\\x22dym\\x22:\\x22Did you mean:\\x22,\\x22lcky\\x22:\\x22I\\\\u0026#39;m Feeling Lucky\\x22,\\x22lml\\x22:\\x22Learn more\\x22,\\x22oskt\\x22:\\x22Input tools\\x22,\\x22psrc\\x22:\\x22This search was removed from your \\\\u003Ca href\\x3d\\\\\\x22/history\\\\\\x22\\\\u003EWeb History\\\\u003C/a\\\\u003E\\x22,\\x22psrl\\x22:\\x22Remove\\x22,\\x22sbit\\x22:\\x22Search by image\\x22,\\x22srch\\x22:\\x22Google Search\\x22},\\x22nrft\\x22:false,\\x22ovr\\x22:{},\\x22pq\\x22:\\x22\\x22,\\x22refpd\\x22:true,\\x22rfs\\x22:[],\\x22sbas\\x22:\\x220 3px 8px 0 rgba(0,0,0,0.2),0 0 0 1px rgba(0,0,0,0.08)\\x22,\\x22sbpl\\x22:16,\\x22sbpr\\x22:16,\\x22scd\\x22:10,\\x22stok\\x22:\\x22SWS8XM1Fq4lFH02HLsUIDnTuY5M\\x22,\\x22uhde\\x22:false}}\';google.pmc=JSON.parse(pmc);})();</script>        </body></html>'

In [ ]:
parsed = parse(urlopen('http://finance.yahoo.com/q/op?s=AAPL+Options'))

In [ ]:
doc = parsed.getroot()

In [ ]:
links = doc.findall('.//a')

In [ ]:
links[15:20]

[<Element a at 0x2c0772b5ef0>,
 <Element a at 0x2c0772b5590>,
 <Element a at 0x2c0772b5c20>,
 <Element a at 0x2c0772b5310>,
 <Element a at 0x2c0772b5b80>]

In [ ]:
lnk = links[28]

In [ ]:
lnk

In [ ]:
lnk.get('href')

'/chart/YM%3DF'

In [ ]:
lnk.text_content()

''

In [ ]:
urls = [lnk.get('href') for lnk in doc.findall('.//a')]

In [ ]:
 urls[-10:]

['https://help.yahoo.com/kb/finance-for-web/SLN2310.html?locale=en_US',
 'https://help.yahoo.com/kb/finance-for-web',
 'https://yahoo.uservoice.com/forums/382977',
 'https://policies.oath.com/us/en/oath/privacy/index.html',
 'https://policies.oath.com/us/en/oath/privacy/adinfo/index.html',
 'https://www.verizonmedia.com/policies/us/en/verizonmedia/terms/otos/index.html',
 'https://finance.yahoo.com/sitemap/',
 'https://twitter.com/YahooFinance',
 'https://facebook.com/yahoofinance',
 'https://www.linkedin.com/company/yahoo-finance']

In [ ]:
tables = doc.findall('.//table')
calls = tables[9]
puts = tables[13]

IndexError: list index out of range

In [ ]:
rows = calls.findall('.//tr')

NameError: name 'calls' is not defined

#### Using Beautiful Soup 4

To install this package with conda run:

      conda install -c anaconda beautifulsoup4

In [ ]:
from urllib.request import urlopen

from bs4 import BeautifulSoup

# Fetch the html file
response = urlopen('http://tutorialspoint.com/python/python_overview.htm')
html_doc = response.read()

# Parse the html file
soup = BeautifulSoup(html_doc, 'html.parser')

# Format the parsed html file
strhtm = soup.prettify()

# Print the first few characters
print (strhtm[:225])

<!DOCTYPE html>
<html lang="en-US">
 <head>
  <title>
   Python - Overview - Tutorialspoint
  </title>
  <meta charset="utf-8"/>
  <meta content="Python - Overview - Python is a high-level, interpreted, interactive and object

In [ ]:
print (soup.title)
print(soup.title.string)
print(soup.a.string)
print(soup.b.string)

<title>Python - Overview - Tutorialspoint</title>
Python - Overview - Tutorialspoint
None
Python is Interpreted

### Reading Microsoft Excel File

### Merging Data Sets

In [ ]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 'data1': range(7)})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [ ]:
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],'data2': range(3)})
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [ ]:
pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [ ]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 'data1': range(7)})
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [ ]:
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'], 'data2': range(3)})
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [ ]:
 pd.merge(df3, df4, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [ ]:
 pd.merge(df1, df2, how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [ ]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [ ]:
df2 = pd.DataFrame({'key': ['a', 'b', 'a', 'b', 'd'],'data2': range(5)})
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [ ]:
pd.merge(df1, df2, on='key', how='left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

In [ ]:
pd.merge(df1, df2, on='key', how='right')

   key  data1  data2
0    a    2.0      0
1    a    4.0      0
2    a    2.0      2
3    a    4.0      2
4    b    0.0      1
5    b    1.0      1
6    b    5.0      1
7    b    0.0      3
8    b    1.0      3
9    b    5.0      3
10   d    NaN      4

In [ ]:
s1 = pd.Series([0, 1], index=['a', 'b'])
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = pd.Series([5, 6], index=['f', 'g'])

#### Merging on Index

The merge key or keys in a DataFrame will be found in its index.

In this case,  pass left_index=True or right_index=True (or both) to indicate that the index should be used as the merge key:

In [ ]:
import pandas as pd
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],'value': range(6)})

left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [ ]:
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])

right1

   group_val
a        3.5
b        7.0

In [ ]:
right2 = pd.DataFrame({ 'key2':['a', 'b'],'group_val': [3.5, 7]})

right2

  key2  group_val
0    a        3.5
1    b        7.0

In [ ]:
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

### Concatenating Along an Axis

Another kind of data combination operation is alternatively referred to as concatenation, binding, or stacking.

NumPy has a concatenate function for doing this with raw NumPy arrays:

In [ ]:
import numpy as np
arr = np.arange(12).reshape((3, 4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [ ]:
 np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

Pandas has concat function for Series and DataFrame

In [ ]:
s1 = pd.Series([0, 1], index=['a', 'b'])

s1

a    0
b    1
dtype: int64

In [ ]:
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])

s2

c    2
d    3
e    4
dtype: int64

In [ ]:
s3 = pd.Series([5, 6], index=['f', 'g'])

s3

f    5
g    6
dtype: int64

In [ ]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [ ]:
pd.concat([s1, s2, s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [ ]:
s4 = pd.concat([s1 * 5, s3])
s4

a    0
b    5
f    5
g    6
dtype: int64

In [ ]:
 pd.concat([s1, s4], axis=1)

     0  1
a  0.0  0
b  1.0  5
f  NaN  5
g  NaN  6

### Combining Data with Overlap

In some data combinations situation canâ€™t be expressed as either a merge or concatenation operation.

In [ ]:
import numpy as np
import pandas as pd
a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan], index=['f', 'e', 'd', 'c', 'b', 'a'])

a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [ ]:
b = pd.Series(np.arange(len(a), dtype=np.float64), index=['f', 'e', 'd', 'c', 'b', 'a'])

b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [ ]:
b[-1] = np.nan

b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    NaN
dtype: float64

In [ ]:
pd.isnull(a)

f     True
e    False
d     True
c    False
b    False
a     True
dtype: bool

In [ ]:
np.where(pd.isnull(a), b, a)

array([0. , 2.5, 2. , 3.5, 4.5, nan])

In [ ]:
df1 = pd.DataFrame({'a': [1., np.nan, 5., np.nan],'b': [np.nan, 2., np.nan, 6.], 'c': range(2, 18, 4)})
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [ ]:
df2 = pd.DataFrame({'a': [5., 4., np.nan, 3., 7.], 'b': [np.nan, 3., 4., 6., 8.]})
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [ ]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

### Reshaping with Hierarchical Indexing

reshape or pivot operations are fundamental operations for rearranging tabular data.

Hierarchical indexing provides a consistent way to rearrange data in a DataFrame.

There are two primary actions:

â€¢ stack: this â€œrotatesâ€ or pivots from the columns in the data to the rows
â€¢ unstack: this pivots from the rows into the columns

In [ ]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)), index=pd.Index(['Ohio', 'Colorado'], name='state'),columns=pd.Index(['one', 'two', 'three'], name='number'))

In [ ]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [ ]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)), index=['Ohio', 'Colorado'], columns=['one', 'two', 'three'] )
data

          one  two  three
Ohio        0    1      2
Colorado    3    4      5

In [ ]:
data.index.name = 'state'
data

          one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [ ]:
data.columns.name='number'

data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

Using the stack method on this data pivots the columns into the rows, producing a Series:

In [ ]:
result = data.stack()
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

From a hierarchically-indexed Series, you can rearrange the data back into a DataFrame with unstack:

In [ ]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

By default the innermost level is unstacked (same with stack). You can unstack a different level by passing a level number or name:

In [ ]:
result.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [ ]:
 result.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

### Pivoting â€œlongâ€ to â€œwideâ€ Format

## Data Transformation

### Removing Duplicates

Duplicate rows may be found in a DataFrame for any number of reasons.

In [ ]:
data = pd.DataFrame({'k1': ['one'] * 3 + ['two'] * 4, 'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [ ]:
data.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

The DataFrame method duplicated returns a boolean Series indicating whether each row is a duplicate or not:

In [ ]:
data.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

### Transforming Data Using a Function or Mapping

In [ ]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon', 'pastrami', 'honey ham', 'nova lox'], 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [ ]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [ ]:
meat_to_animal = {
 'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'
}

In [ ]:
data['animal'] = data['food'].map(str.lower).map(meat_to_animal)

In [ ]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

### Replacing Values

In [ ]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [ ]:
data2=data

In [ ]:
data2

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [ ]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

The -999 values might be sentinel values for missing data. To replace these with NA values that pandas understands, we can use replace, producing a new Series:

If you want to replace multiple values at once, you instead pass a list then the substitute value:

In [ ]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

To use a different replacement for each value, pass a list of substitutes:

In [ ]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Indexes

In [ ]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),index=['Ohio', 'Colorado', 'New York'], columns=['one', 'two', 'three', 'four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [ ]:
data2=data

In [ ]:
data2

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

the axis indexes have a map method:

In [ ]:
data.index.map(str.upper)

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [ ]:
data.columns.map(str.upper)

Index(['ONE', 'TWO', 'THREE', 'FOUR'], dtype='object')

In [ ]:
data2.cloumns=data.columns.map(str.upper)

In [ ]:
data2

Index(['ONE', 'TWO', 'THREE', 'FOUR'], dtype='object')

We can assign to index, modifying the DataFrame in place:

In [ ]:
data.index = data.index.map(str.upper)

data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [ ]:
data.rename(index={'OHIO': 'INDIANA'},columns={'three': '3'})

          one  two   3  four
INDIANA     0    1   2     3
COLORADO    4    5   6     7
NEW YORK    8    9  10    11

In [ ]:
data.columns = data.columns.map(str.upper)
data

          ONE  TWO  THREE  FOUR
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

If you want to create a transformed version of a data set without modifying the original, a useful method is rename:

In [ ]:
data.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [ ]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),index=['Ohio', 'Colorado', 'New York'], columns=['one', 'two', 'three', 'four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

 rename can be used to provide new values for a subset of the axis labels:

In [ ]:
data.rename(index={'Ohio': 'INDIANA'},columns={'three': '3'})

          one  two   3  four
INDIANA     0    1   2     3
Colorado    4    5   6     7
New York    8    9  10    11

### Discretization and Binning

Bins are the number of intervals you want to divide all of your data into, such that it can be displayed as bars on a histogram or chart.

Ex: - We have data about a group of people in a study, and you want to group them into discrete age buckets:

In [ ]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

Divide these into bins of 18 to 25, 26 to 35, 35 to 60, and finally 60 and older.

--- use cut, a function in pandas:

In [ ]:
bins = [18, 25, 35, 60, 100]

In [ ]:
import pandas as pd

cats = pd.cut(ages, bins)

In [ ]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

The object pandas returns is a special Categorical object.

In [ ]:
cats.labels

AttributeError: 'Categorical' object has no attribute 'labels'

 Internally it contains a levels array indicating the distinct category names along with a labeling for the ages data

In [ ]:
cats.levels

AttributeError: 'Categorical' object has no attribute 'levels'

In [ ]:
 pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [ ]:
import numpy as np
import pandas as pd
np.random.seed(12345)

np.random.randn(5)

array([-0.20470766,  0.47894334, -0.51943872, -0.5557303 ,  1.96578057])

### Detecting and Filtering Outliers

In [ ]:
import numpy as np
import pandas as pd
np.random.seed(12345)
data = pd.DataFrame(np.random.randn(1000, 4))
data

            0         1         2         3
0   -0.204708  0.478943 -0.519439 -0.555730
1    1.965781  1.393406  0.092908  0.281746
2    0.769023  1.246435  1.007189 -1.296221
3    0.274992  0.228913  1.352917  0.886429
4   -2.001637 -0.371843  1.669025 -0.438570
..        ...       ...       ...       ...
995  1.089085  0.251232 -1.451985  1.653126
996 -0.478509 -0.010663 -1.060881 -1.502870
997 -1.946267  1.013592  0.037333  0.133304
998 -1.293122 -0.322542 -0.782960 -0.303340
999  0.089987  0.292291  1.177706  0.882755

[1000 rows x 4 columns]

In [ ]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067684     0.067924     0.025598    -0.002298
std       0.998035     0.992106     1.006835     0.996794
min      -3.428254    -3.548824    -3.184377    -3.745356
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.366626     2.653656     3.260383     3.927528

In [ ]:
data

            0         1         2         3
0   -0.204708  0.478943 -0.519439 -0.555730
1    1.965781  1.393406  0.092908  0.281746
2    0.769023  1.246435  1.007189 -1.296221
3    0.274992  0.228913  1.352917  0.886429
4   -2.001637 -0.371843  1.669025 -0.438570
..        ...       ...       ...       ...
995  1.089085  0.251232 -1.451985  1.653126
996 -0.478509 -0.010663 -1.060881 -1.502870
997 -1.946267  1.013592  0.037333  0.133304
998 -1.293122 -0.322542 -0.782960 -0.303340
999  0.089987  0.292291  1.177706  0.882755

[1000 rows x 4 columns]

Find values in one of the columns exceeding three in magnitude:

In [ ]:
col = data[3]
col

0     -0.555730
1      0.281746
2     -1.296221
3      0.886429
4     -0.438570
         ...
995    1.653126
996   -1.502870
997    0.133304
998   -0.303340
999    0.882755
Name: 3, Length: 1000, dtype: float64

In [ ]:
col[np.abs(col) > 3]

97     3.927528
305   -3.399312
400   -3.745356
Name: 3, dtype: float64

To select all rows having a value exceeding 3 or -3,  use the any method on a boolean DataFrame:

In [ ]:
 data[(np.abs(data) > 3).any(1)]

            0         1         2         3
5   -0.539741  0.476985  3.248944 -1.021228
97  -0.774363  0.552936  0.106061  3.927528
102 -0.655054 -0.565230  3.176873  0.959533
305 -2.315555  0.457246 -0.025907 -3.399312
324  0.050188  1.951312  3.260383  0.963301
400  0.146326  0.508391 -0.196713 -3.745356
499 -0.293333 -0.242459 -3.056990  1.918403
523 -3.428254 -0.296336 -0.439938 -0.867165
586  0.275144  1.179227 -3.184377  1.369891
808 -0.362528 -3.548824  1.553205 -2.186301
900  3.366626 -2.372214  0.851010  1.332846

### Permutation and Random Sampling

Use the numpy.random.permutation function to perform Permutation (randomly reordering) on a Series or the rows in a DataFrame.

Calling permutation  produces an array of integers indicating the new ordering:

In [ ]:
df = pd.DataFrame(np.arange(5 * 4).reshape(5, 4))

In [ ]:
sampler = np.random.permutation(5)

sampler

array([1, 0, 2, 3, 4])

In [ ]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [ ]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
0   0   1   2   3
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

### GroupBy on DataFrames , Dict and Series

In [ ]:
 df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],'key2' : ['one', 'two', 'one', 'two', 'one'], 'data1' : np.random.randn(5), 'data2' : np.random.randn(5)})

In [ ]:
df

  key1 key2     data1     data2
0    a  one  0.046486 -0.155385
1    a  two -0.610441 -0.153514
2    b  one -0.394982  0.011194
3    b  two  1.199915 -0.050555
4    a  one -0.451814  0.420211

Compute the mean of the data1 column using the groups labels from key1.

Access data1 and call groupby with the column (a Series) at key1:

In [ ]:
grouped = df['data1'].groupby(df['key1'])

grouped

In [ ]:
grouped

This grouped variable is now a GroupBy object.

In [ ]:
grouped.mean()

key1
a   -0.338590
b    0.402467
Name: data1, dtype: float64

Pass multiple arrays as a list

In [ ]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [ ]:
means

key1  key2
a     one    -0.202664
      two    -0.610441
b     one    -0.394982
      two     1.199915
Name: data1, dtype: float64

It grouped the data using two keys, and the resulting Series now has a hierarchical index consisting of the unique pairs of keys

In [ ]:
means.unstack('key1')

key1         a         b
key2
one  -0.202664 -0.394982
two  -0.610441  1.199915

A generally useful GroupBy method is size which return a Series containing group sizes:

In [ ]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

#### Iterating Over Groups

In [ ]:
 for name, group in df.groupby('key1'): 
        print(name)
        print(group)

a
  key1 key2     data1     data2
0    a  one  0.046486 -0.155385
1    a  two -0.610441 -0.153514
4    a  one -0.451814  0.420211
b
  key1 key2     data1     data2
2    b  one -0.394982  0.011194
3    b  two  1.199915 -0.050555

#### Selecting a Column or Subset of Columns

Indexing a GroupBy object created from a DataFrame with a column name or array of
column names has the effect of selecting those columns for aggregation.

In [ ]:
df.groupby('key1')['data1']

In [ ]:
df.groupby('key1')[['data2']]

In [ ]:
df['data1'].groupby(df['key1'])

In [ ]:
df[['data2']].groupby(df['key1'])

Compute means for just the data2 column and get the result as a DataFrame,

In [ ]:
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one   0.132413
     two  -0.153514
b    one   0.011194
     two  -0.050555

In [ ]:
s_grouped = df.groupby(['key1', 'key2'])['data2']

In [ ]:
s_grouped

In [ ]:
s_grouped.mean()

key1  key2
a     one     0.132413
      two    -0.153514
b     one     0.011194
      two    -0.050555
Name: data2, dtype: float64

#### Grouping with Dicts and Series

In [ ]:
people = pd.DataFrame(np.random.randn(5, 5), columns=['a', 'b', 'c', 'd', 'e'], index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [ ]:
 people.loc[2:3, ['b', 'c']] = np.nan # Add a few NA values

<ipython-input-267-17fa7ccb3faa>:1: FutureWarning: Slicing a positional slice with .loc is not supported, and will raise TypeError in a future version.  Use .loc with labels or .iloc with positions instead.
  people.loc[2:3, ['b', 'c']] = np.nan # Add a few NA values

In [ ]:
people

               a         b         c         d         e
Joe     1.190981  1.561488 -1.132925  0.097083 -1.031573
Steve  -0.044618 -0.218153  0.772942 -0.728643  0.215523
Wes    -2.056737       NaN       NaN  0.722045 -0.954567
Jim     0.943233  1.192702  1.035828  1.031435  0.179642
Travis -0.625160  1.754117  0.665097  0.996054  1.254051

Now, suppose I have a group correspondence for the columns and want to sum together
the columns by group:

In [ ]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f' : 'orange'}

In [ ]:
by_column = people.groupby(mapping, axis=1)

In [ ]:
by_column

In [ ]:
by_column.sum()

            blue       red
Joe    -1.035842  1.720896
Steve   0.044298 -0.047248
Wes     0.722045 -3.011304
Jim     2.067264  2.315576
Travis  1.661151  2.383009

The same functionality holds for Series,

In [ ]:
map_series = pd.Series(mapping)

In [ ]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [ ]:
people.groupby(map_series, axis=1)

In [ ]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

### Data Aggregation with Pandas

Data Aggregation :  Any data transformation that produces scalar values from arrays.

Ex:  mean, count, min and sum.

You can use aggregations of your own devising and additionally call any method that is also defined on the grouped object.

Ex: quantile computes sample quantiles of a Series or a DataFrameâ€™s columns.

In [ ]:
import numpy as np
import pandas as pd
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],'key2' : ['one', 'two', 'one', 'two', 'one'], 'data1' : np.random.randn(5), 'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -1.483466  0.773956
1    a  two  0.105564  1.658163
2    b  one  1.197847 -1.110912
3    b  two -1.302326 -1.433462
4    a  one -0.255649  0.517118

In [ ]:
grouped = df.groupby('key1')

In [ ]:
grouped

In [ ]:
grouped['data1'].quantile(0.9)

key1
a   -1.633550
b   -0.104478
Name: data1, dtype: float64

To use your own aggregation functions, pass any function that aggregates an array to
the aggregate or agg method:

In [ ]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [ ]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     1.211761  1.327773
b     0.269545  1.718514

In [ ]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  0.580692  0.611180 -0.071556  0.300936  0.673429  0.906817
b      2.0 -0.004624  0.190597 -0.139397 -0.072011 -0.004624  0.062762

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     1.140204   3.0 -0.885422  0.763460 -1.766967 -1.108536 -0.450105
b     0.130148   2.0  0.684332  1.215173 -0.174925  0.254703  0.684332


          75%       max
key1
a    -0.44465 -0.439194
b     1.11396  1.543588

Optimized groupby methods

Function name           Description

count             Number of non-NA values in the group
sum               Sum of non-NA values
mean              Mean of non-NA values
median            Arithmetic median of non-NA values
std, var          Unbiased (n - 1 denominator) standard deviation and variance
min, max          Minimum and maximum of non-NA values
prod              Product of non-NA values
first, last       First and last non-NA values

### Splitting Applying and Combining

In [ ]:
import pandas as pd
tips = pd.read_csv('tips.csv')

In [ ]:
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [ ]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [ ]:
tips

     total_bill   tip     sex smoker   day    time  size   tip_pct
0         16.99  1.01  Female     No   Sun  Dinner     2  0.059447
1         10.34  1.66    Male     No   Sun  Dinner     3  0.160542
2         21.01  3.50    Male     No   Sun  Dinner     3  0.166587
3         23.68  3.31    Male     No   Sun  Dinner     2  0.139780
4         24.59  3.61  Female     No   Sun  Dinner     4  0.146808
..          ...   ...     ...    ...   ...     ...   ...       ...
239       29.03  5.92    Male     No   Sat  Dinner     3  0.203927
240       27.18  2.00  Female    Yes   Sat  Dinner     2  0.073584
241       22.67  2.00    Male    Yes   Sat  Dinner     2  0.088222
242       17.82  1.75    Male     No   Sat  Dinner     2  0.098204
243       18.78  3.00  Female     No  Thur  Dinner     2  0.159744

[244 rows x 8 columns]

In [ ]:
tips.groupby('smoker')

### Cross Tabulation

### SQL with Python